<a href="https://colab.research.google.com/github/smit-collab/practice/blob/main/Automobile_data(pandas_exercise).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
df = pd.read_csv('Automobile_data.csv',
                 na_values=['?','NaN'])

In [ ]:
df.info

<bound method DataFrame.info of     index      company   body-style  ...  horsepower  average-mileage    price
0       0  alfa-romero  convertible  ...         111               21  13495.0
1       1  alfa-romero  convertible  ...         111               21  16500.0
2       2  alfa-romero    hatchback  ...         154               19  16500.0
3       3         audi        sedan  ...         102               24  13950.0
4       4         audi        sedan  ...         115               18  17450.0
..    ...          ...          ...  ...         ...              ...      ...
56     81   volkswagen        sedan  ...          85               27   7975.0
57     82   volkswagen        sedan  ...          52               37   7995.0
58     86   volkswagen        sedan  ...         100               26   9995.0
59     87        volvo        sedan  ...         114               23  12940.0
60     88        volvo        wagon  ...         114               23  13415.0

[61 rows x 10 columns]>

### first and last five rows

In [ ]:
df.head(5)

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0
3      3         audi        sedan  ...         102               24  13950.0
4      4         audi        sedan  ...         115               18  17450.0

[5 rows x 10 columns]

In [ ]:
df.tail(5)

    index     company body-style  ...  horsepower  average-mileage    price
56     81  volkswagen      sedan  ...          85               27   7975.0
57     82  volkswagen      sedan  ...          52               37   7995.0
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[5 rows x 10 columns]

In [ ]:
df.isna().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

### Max price of the car

In [ ]:
df1 = df[['company','price']][df.price==df['price'].max()]
df1

          company    price
35  mercedes-benz  45400.0

### Print All Toyota Cars details

In [ ]:
cars = df.groupby('company')
toyota_df = cars.get_group('toyota')
toyota_df

    index company body-style  ...  horsepower  average-mileage    price
48     66  toyota  hatchback  ...          62               35   5348.0
49     67  toyota  hatchback  ...          62               31   6338.0
50     68  toyota  hatchback  ...          62               31   6488.0
51     69  toyota      wagon  ...          62               31   6918.0
52     70  toyota      wagon  ...          62               27   7898.0
53     71  toyota      wagon  ...          62               27   8778.0
54     79  toyota      wagon  ...         156               19  15750.0

[7 rows x 10 columns]

### Count total cars per company

In [ ]:
df['company'].value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
mitsubishi       4
mercedes-benz    4
audi             4
volkswagen       4
porsche          3
alfa-romero      3
honda            3
chevrolet        3
jaguar           3
isuzu            3
volvo            2
dodge            2
Name: company, dtype: int64

### each companyâ€™s Higesht price car

In [ ]:
cars = df.groupby('company')
cars[['company','price']].max()

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu   6785.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

### average mileage of each car making company

In [ ]:
cars = df.groupby('company')
cars[['company','average-mileage']].mean()

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

### Sort all cars by Price column

In [ ]:
df.sort_values(by=['price','horsepower'],ascending=False).head(10)

    index        company   body-style  ...  horsepower  average-mileage    price
35     47  mercedes-benz      hardtop  ...         184               14  45400.0
11     14            bmw        sedan  ...         182               16  41315.0
34     46  mercedes-benz        sedan  ...         184               14  40960.0
46     62        porsche  convertible  ...         207               17  37028.0
12     15            bmw        sedan  ...         182               15  36880.0
26     35         jaguar        sedan  ...         262               13  36000.0
25     34         jaguar        sedan  ...         176               15  35550.0
45     61        porsche      hardtop  ...         207               17  34028.0
24     33         jaguar        sedan  ...         176               15  32250.0
10     13            bmw        sedan  ...         182               16  30760.0

[10 rows x 10 columns]

### Joining two data frames using the conditions:

A very high level difference is that merge() is used to combine two (or more) dataframes on the basis of values of common columns (indices can also be used, use left_index=True and/or right_index=True), and concat() is used to append one (or more) dataframes one below the other (or sideways, depending on whether the axis option is set to 0 or 1).

for more information Refer :https://stackoverflow.com/questions/38256104/differences-between-merge-and-concat-in-pandas

In [ ]:
# dict
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}

# dict to dataframe
german_cars_df = pd.DataFrame.from_dict(GermanCars)
japanese_cars_df = pd.DataFrame.from_dict(japaneseCars)

cars_conc_df = pd.concat([german_cars_df,japanese_cars_df],keys=["Germany","Japan"])
cars_conc_df

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

In [ ]:
# dict
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

# converting dict to dataframe
car_price_df = pd.DataFrame.from_dict(Car_Price)
car_Horsepower_df = pd.DataFrame.from_dict(car_Horsepower)

car_pri_horse_df = pd.merge(car_price_df,car_Horsepower_df, on="Company")
car_pri_horse_df

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160